#### Terraform Format and Style 🖌`success`
#### Terraform Linter ☑️`success`
#### Checkov 👮‍️`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
module.cdn_certificate.aws_acm_certificate.default: Refreshing state... [id=arn:aws:acm:us-east-1:773224345969:certificate/2d40db01-2075-46df-bd9c-33900d352bc1]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_kms_key.replica[0]: Refreshing state... [id=407d7624-76cf-4bef-8cd2-3e98fdc49b06]
module.cdn_with_s3_bucket.aws_s3_bucket.default: Refreshing state... [id=www.copotrzebne.pl]
module.hosting_zone.aws_route53_zone.default: Refreshing state... [id=Z069677928IRZ1DEOYQ5K]
module.cdn_with_s3_bucket.aws_cloudfront_origin_access_identity.default: Refreshing state... [id=E2O5C6PV3OYY5A]
module.redirect.aws_s3_bucket_acl.default: Refreshing state... [id=copotrzebne.pl,public-read]
module.redirect.aws_s3_bucket_website_configuration.default: Refreshing state... [id=copotrzebne.pl]
module.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c0da428cb60df41e]
module.cdn_with_s3_bucket.aws_iam_user.deployer: Refreshing state... [id=ci-s3-website-deployer]
module.redirect.aws_s3_bucket.default: Refreshing state... [id=copotrzebne.pl]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_iam_role.replication[0]: Refreshing state... [id=tf-remote-state-replication-role20220313213332982600000001]
module.remote-state-s3-backend.module.remote_state.aws_kms_key.this: Refreshing state... [id=18bf1c92-6ff5-4ff0-b338-12f111ec4056]
module.cdn_with_s3_bucket.aws_iam_access_key.deployer_access_key: Refreshing state... [id=AKIA3IB6DGFY7CZ4Q4IU]
module.cdn_certificate.aws_route53_record.default["*.copotrzebne.pl"]: Refreshing state... [id=Z069677928IRZ1DEOYQ5K__8f9b6b3a14cf4030a072f5f919b4cc67.copotrzebne.pl._CNAME]
module.cdn_certificate.aws_route53_record.default["copotrzebne.pl"]: Refreshing state... [id=Z069677928IRZ1DEOYQ5K__8f9b6b3a14cf4030a072f5f919b4cc67.copotrzebne.pl._CNAME]
module.cdn_certificate.aws_acm_certificate_validation.default: Refreshing state... [id=2022-03-14 11:00:16.74 +0000 UTC]
module.remote-state-s3-backend.module.remote_state.aws_dynamodb_table.lock: Refreshing state... [id=tf-remote-state-lock]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_public_access_block.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_acl.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica,private]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_versioning.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_server_side_encryption_configuration.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_lifecycle_configuration.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_policy.replica_force_ssl[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.network.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-06dc00578a9e8ad0e]
module.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ca9f6c6212cb3e04]
module.network.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a5e87f3565c7df2a]
module.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bcbf3c26e7a91cae]
module.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02570465fd3db0a3f]
module.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05874fb8c8da09d57]
module.network.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-028ad6764f9d229bf]
module.network.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0ffb48beffb1bd9b6]
module.network.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0daa6ee62711fd7ba]
module.network.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-003923e88d885384c]
module.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-087e92d7c75eeceea]
module.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05e09846c3422dabf]
module.network.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c7c487fa57e03388]
module.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0dc22aa0ca8813784]
module.cdn_with_s3_bucket.aws_s3_bucket_acl.default: Refreshing state... [id=www.copotrzebne.pl,private]
module.cdn_with_s3_bucket.aws_s3_bucket_public_access_block.default: Refreshing state... [id=www.copotrzebne.pl]
module.cdn_with_s3_bucket.aws_cloudfront_distribution.default: Refreshing state... [id=E279C1CJNYSVZY]
module.network.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d8f3cd84c3c80cd2]
module.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c20f47c7dc469f5a]
module.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b024057d1c732116]
module.redirect.aws_cloudfront_distribution.default: Refreshing state... [id=EBILQA53T25SK]
module.cdn_with_s3_bucket.aws_s3_bucket_policy.default: Refreshing state... [id=www.copotrzebne.pl]
module.network.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0de32b8951a74afed]
module.network.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=copotrzebne-network]
module.network.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0de499a970389ed29]
module.network.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0efca78ddd7e6b227]
module.remote-state-s3-backend.module.remote_state.aws_iam_policy.terraform[0]: Refreshing state... [id=arn:aws:iam::773224345969:policy/terraform20220313213352666600000003]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_server_side_encryption_configuration.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_iam_policy.replication[0]: Refreshing state... [id=arn:aws:iam::773224345969:policy/tf-remote-state-replication-policy20220313213341970900000002]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_lifecycle_configuration.state[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_public_access_block.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_acl.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1,private]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_versioning.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0dc22aa0ca88137841080289494]
module.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a2ea76866b42512b]
module.network.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-089cb48b1141c6f14]
module.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dd7f4d71d61278b4]
module.cdn_with_s3_bucket.aws_route53_record.default: Refreshing state... [id=Z069677928IRZ1DEOYQ5K_www.copotrzebne.pl_A]
module.redirect.aws_route53_record.default: Refreshing state... [id=Z069677928IRZ1DEOYQ5K_copotrzebne.pl_A]
module.remote-state-s3-backend.module.remote_state.aws_iam_policy_attachment.replication[0]: Refreshing state... [id=tf-iam-role-attachment-replication-configuration]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_policy.state_force_ssl: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.cdn_with_s3_bucket.aws_iam_user_policy.deployer_policy: Refreshing state... [id=ci-s3-website-deployer:ci-s3-website-deployer]
module.rds.aws_db_instance.default: Refreshing state... [id=terraform-20220318204856649500000001]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_replication_configuration.state[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.container_orchestrator.aws_autoscaling_group.ec2_autoscaling will be created
  + resource "aws_autoscaling_group" "ec2_autoscaling" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = "copotrzebne-ecs-asg"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-05e09846c3422dabf",
          + "subnet-087e92d7c75eeceea",
          + "subnet-0c7c487fa57e03388",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id   = (known after apply)
          + name = "copotrzebne-ecs-lt"
        }

      + tag {
          + key                 = "Cluster"
          + propagate_at_launch = true
          + value               = "copotrzebne-ecs"
        }
    }

  # module.container_orchestrator.aws_ecs_capacity_provider.ec2_provider will be created
  + resource "aws_ecs_capacity_provider" "ec2_provider" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "copotrzebne-ecs-ec2-capacity-provider"
      + tags_all = {
          + "env"       = "prod"
          + "terraform" = "true"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = (known after apply)
              + minimum_scaling_step_size = (known after apply)
              + status                    = (known after apply)
              + target_capacity           = (known after apply)
            }
        }
    }

  # module.container_orchestrator.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "copotrzebne-ecs"
      + tags_all           = {
          + "env"       = "prod"
          + "terraform" = "true"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "NONE"
            }
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.container_orchestrator.aws_ecs_cluster_capacity_providers.ec2_providers will be created
  + resource "aws_ecs_cluster_capacity_providers" "ec2_providers" {
      + capacity_providers = [
          + "copotrzebne-ecs-ec2-capacity-provider",
        ]
      + cluster_name       = "copotrzebne-ecs"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "copotrzebne-ecs-ec2-capacity-provider"
          + weight            = 0
        }
    }

  # module.container_repository.aws_ecr_repository.container_repository will be created
  + resource "aws_ecr_repository" "container_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "copotrzebne-container-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "env"       = "prod"
          + "terraform" = "true"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.container_orchestrator.module.launch_template.aws_iam_instance_profile.ecs_instance_profile will be created
  + resource "aws_iam_instance_profile" "ecs_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecsInstanceRole-copotrzebne-ecs-lt"
      + path        = "/"
      + role        = "ecs-instance-role-copotrzebne-ecs-lt"
      + tags_all    = {
          + "env"       = "prod"
          + "terraform" = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.container_orchestrator.module.launch_template.aws_iam_role.ecs_instance_role will be created
  + resource "aws_iam_role" "ecs_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-instance-role-copotrzebne-ecs-lt"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "env"       = "prod"
          + "terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.container_orchestrator.module.launch_template.aws_iam_role_policy_attachment.ecs_instance_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "ecs-instance-role-copotrzebne-ecs-lt"
    }

  # module.container_orchestrator.module.launch_template.aws_launch_template.ec2_launch_template will be created
  + resource "aws_launch_template" "ec2_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = (sensitive)
      + instance_type   = "t2.micro"
      + latest_version  = (known after apply)
      + name            = "copotrzebne-ecs-lt"
      + name_prefix     = (known after apply)
      + tags_all        = {
          + "env"       = "prod"
          + "terraform" = "true"
        }
      + user_data       = "IyEvYmluL2Jhc2gKIyBUaGUgY2x1c3RlciB0aGlzIGFnZW50IHNob3VsZCBjaGVjayBpbnRvLgplY2hvICdFQ1NfQ0xVU1RFUj1jb3BvdHJ6ZWJuZS1lY3MnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKIyBEaXNhYmxlIHByaXZpbGVnZWQgY29udGFpbmVycy4KZWNobyAnRUNTX0RJU0FCTEVfUFJJVklMRUdFRD10cnVlJyA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCg=="

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = [
              + "sg-09ed29797b2d9578f",
            ]
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @wojtekk, Action: `pull_request`*